renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/r_cellular_if.h
/*
 * Copyright (c) 2025 Renesas Electronics Corporation and/or its affiliates
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/**********************************************************************************************************************
 * File Name    : r_cellular_if.h
 * Description  : Configures the driver.
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>

#include "r_bsp_config.h"
#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
#include "r_sci_rx_if.h"
#include "r_sci_rx_pinset.h"
#include "r_irq_rx_if.h"
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
#include "r_sci_rl_if.h"
#endif

#if BSP_CFG_RTOS_USED == (1)
#include "FreeRTOS.h"
#include "semphr.h"
#include "task.h"
#include "event_groups.h"
#elif BSP_CFG_RTOS_USED == (5)
#include <tx_api.h>
#include <tx_mutex.h>
#include <tx_thread.h>
#include <tx_semaphore.h>
#endif

#include "r_cellular_config.h"
#include "r_cellular_private.h"
#include "ryz014_private.h"

#ifndef CELLULAR_IF_H
#define CELLULAR_IF_H

/**********************************************************************************************************************
 * Macro definitions
 *********************************************************************************************************************/
#if (defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__) && defined(__LIT)) \
    || (defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL))
/* Converts IP address to 32 bits in little endian. */
#define CELLULAR_IP_ADDER_CONVERT(IPv4_0, IPv4_1, IPv4_2, IPv4_3)\
                                ( ( ( ( uint32_t ) ( IPv4_3 ) ) << 24UL ) |    \
                                ( ( ( uint32_t ) ( IPv4_2 ) ) << 16UL ) |    \
                                ( ( ( uint32_t ) ( IPv4_1 ) ) << 8UL ) |    \
                                ( ( uint32_t ) ( IPv4_0 ) ) )
#else
/* Convert IP address to 32 bits in big endian. */
#define CELLULAR_IP_ADDER_CONVERT(IPv4_0, IPv4_1, IPv4_2, IPv4_3)\
                                ( ( ( ( uint32_t ) ( IPv4_0 ) ) << 24UL ) |    \
                                ( ( ( uint32_t ) ( IPv4_1 ) ) << 16UL ) |    \
                                ( ( ( uint32_t ) ( IPv4_2 ) ) << 8UL ) |    \
                                ( ( uint32_t ) ( IPv4_3 ) ) )
#endif

/**********************************************************************************************************************
 * Typedef definitions
 *********************************************************************************************************************/
typedef enum
{
    CELLULAR_SUCCESS                     = 0,   // Successful
    CELLULAR_ERR_PARAMETER               = -1,  // Argument is abnormal
    CELLULAR_ERR_ALREADY_OPEN            = -2,  // Already initialized
    CELLULAR_ERR_NOT_OPEN                = -3,  // Not initialized
    CELLULAR_ERR_SERIAL_OPEN             = -4,  // Serial initialization failed
    CELLULAR_ERR_MODULE_COM              = -5,  // Communication with module failed
    CELLULAR_ERR_MODULE_TIMEOUT          = -6,  // Communication with module timed out
    CELLULAR_ERR_NOT_CONNECT             = -7,  // Not connected to access point
    CELLULAR_ERR_ALREADY_CONNECT         = -8,  // Already connect to access point
    CELLULAR_ERR_ALREADY_SOCKET_CONNECT  = -9,  // Already socket connect
    CELLULAR_ERR_SOCKET_NOT_READY        = -10, // Socket is not ready for use
    CELLULAR_ERR_SOCKET_CREATE_LIMIT     = -11, // Socket creation limit exceeded
    CELLULAR_ERR_BYTEQ_OPEN              = -12, // Failed to initialize the byte queue
    CELLULAR_ERR_SEMAPHORE_INIT          = -13, // Failed to initialize the semaphore
    CELLULAR_ERR_EVENT_GROUP_INIT        = -14, // Failed to initialize the event group
    CELLULAR_ERR_CREATE_TASK             = -15, // Failed to create task
    CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING = -16, // Other AT commands are running
    CELLULAR_ERR_OTHER_API_RUNNING       = -17, // Other API are running
    CELLULAR_ERR_MEMORY_ALLOCATION       = -18, // Failed to allocate memory
    CELLULAR_ERR_IRQ_OPEN                = -19, // IRQ initialization failed
    CELLULAR_ERR_SIM_NOT_SUPPORT_IPV6    = -20, // The SIM card does not support IPv6
    CELLULAR_ERR_AP_CONNECT_FAILED       = -21, // AP connection failed.
    CELLULAR_ERR_RECV_TASK               = -22, // Receiving task operation error
} e_cellular_err_t;

typedef enum
{
    CELLULAR_SYSTEM_CLOSE = 0,  // Open function unexecuted
    CELLULAR_SYSTEM_OPEN,       // Open function already executed
    CELLULAR_SYSTEM_CONNECT,    // Connecting to AP
} e_cellular_system_status_t;

typedef enum
{
    CELLULAR_MODULE_OPERATING_LEVEL0 = 0,    // Default
    CELLULAR_MODULE_OPERATING_LEVEL1,        // Full functional use possible
    CELLULAR_MODULE_OPERATING_LEVEL2,        // Transmission function disabled
    CELLULAR_MODULE_OPERATING_LEVEL3,        // Reception function disabled
    CELLULAR_MODULE_OPERATING_LEVEL4,        // In-flight mode
    CELLULAR_MODULE_OPERATING_LEVEL5,        // Reserved
    CELLULAR_MODULE_OPERATING_RESET,         // Module Reset
} e_cellular_module_status_t;

typedef enum
{
    CELLULAR_DISABLE_NETWORK_RESULT_CODE = 0,   // Disable automatic notification of network connection status
    CELLULAR_ENABLE_NETWORK_RESULT_CODE_LEVEL1, // Enable network registration unsolicited result code
    CELLULAR_ENABLE_NETWORK_RESULT_CODE_LEVEL2, // Enable network registration and location information unsolicited result code
    CELLULAR_ENABLE_NETWORK_RESULT_CODE_LEVEL3, // Enable network registration, location information and EMM cause value information unsolicited result code
    CELLULAR_ENABLE_NETWORK_RESULT_CODE_LEVEL4, // For a UE that wants to apply PSM, enable network registration and location information unsolicited result code
    CELLULAR_ENABLE_NETWORK_RESULT_CODE_LEVEL5, // For a UE that wants to apply PSM, enable network registration, location information and EMM cause value information unsolicited result code
} e_cellular_network_result_t;

