renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/r_cellular_if.h
typedef enum
{
    CELLULAR_REG_STATS_VALUE0 = 0,  // Not registered
    CELLULAR_REG_STATS_VALUE1,      // Registered, home network
    CELLULAR_REG_STATS_VALUE2,      // Not registered, but MT is currently trying to attach or searching
    CELLULAR_REG_STATS_VALUE3,      // Registration denied
    CELLULAR_REG_STATS_VALUE4,      // Unknown
    CELLULAR_REG_STATS_VALUE5,      // Registered, roaming
    CELLULAR_REG_STATS_VALUE6,      // Registered for "SMS only", home network
    CELLULAR_REG_STATS_VALUE7,      // Registered for "SMS only", roaming
    CELLULAR_REG_STATS_VALUE8,      // Attached for emergency bearer services only
    CELLULAR_REG_STATS_VALUE9,      // Registered for "CSFB not preferred", home network
    CELLULAR_REG_STATS_VALUE10,     // Registered for "CSFB not preferred", roaming
    CELLULAR_REG_STATS_VALUE80,     // Registered, temporary connection lost
} e_cellular_reg_stat_t;

typedef enum
{
    CELLULAR_ACCESS_TEC0 = 0,       // GSM
    CELLULAR_ACCESS_TEC1,           // GSM Compact
    CELLULAR_ACCESS_TEC2,           // UTRAN
    CELLULAR_ACCESS_TEC3,           // GSM w/EGPRS
    CELLULAR_ACCESS_TEC4,           // UTRAN w/HSDPA
    CELLULAR_ACCESS_TEC5,           // UTRAN w/HSUPA
    CELLULAR_ACCESS_TEC6,           // UTRAN w/HSDPA and HSUPA
    CELLULAR_ACCESS_TEC7,           // E-UTRAN
} e_cellular_access_tec_t;

typedef enum
{
    CELLULAR_INFO_TYPE0 = 0,    // Report information for the serving cell only
    CELLULAR_INFO_TYPE1 = 1,    // Report information for the intra-frequency cells only
    CELLULAR_INFO_TYPE2 = 2,    // Report information for the intra-frequency cells only
    CELLULAR_INFO_TYPE7 = 7,    // Report information for all cells
    CELLULAR_INFO_TYPE9 = 9,    // Report information for the serving cell only with RSRP/CINR on main antenna.
} e_cellular_info_type_t;

typedef enum
{
    CELLULAR_SOCKET_STATUS_CLOSED = 0,  // Socket uncreated
    CELLULAR_SOCKET_STATUS_SOCKET,      // Socket creation
    CELLULAR_SOCKET_STATUS_CONNECTED,   // Socket connected
    CELLULAR_SOCKET_STATUS_MAX,         // End of enumeration
} e_cellular_socket_status_t;

typedef enum
{
    CELLULAR_TX_END_FLAG_OFF = 0,   // TX end flag off
    CELLULAR_TX_END_FLAG_ON,        // TX end flag on
} e_cellular_tx_end_flg_t;

typedef enum
{
    CELLULAR_RECEIVE_FLAG_OFF = 0,  // Receive flag off
    CELLULAR_RECEIVE_FLAG_ON,       // Receive flag off
} e_cellular_receive_flg_t;

typedef enum
{
    CELLULAR_ATC_OK                 = 0,    // Successful
    CELLULAR_ATC_ERR_PARAMETER      = -1,   // Argument is abnormal
    CELLULAR_ATC_ERR_MODULE_COM     = -2,   // Communication with module failed
    CELLULAR_ATC_ERR_COMPARE        = -3,   // The return value from the module is disappointing.
    CELLULAR_ATC_ERR_TIMEOUT        = -4,   // Time out
} e_cellular_err_atc_t;

typedef enum
{
    CELLULAR_NOT_TIMEOUT    = 0,    // No timeout.
    CELLULAR_TIMEOUT        = -1,   // Timeout
} e_cellular_timeout_check_t;

typedef enum
{
    CELLULAR_SEMAPHORE_SUCCESS  = 0,    // Semaphore processing succeeded
    CELLULAR_SEMAPHORE_ERR_GIVE = -1,   // Semaphore release failed
    CELLULAR_SEMAPHORE_ERR_TAKE = -2,   // Semaphore acquisition failed.
} e_cellular_err_semaphore_t;

typedef enum
{
    CELLULAR_TIMEOUT_NOT_OVERFLOW = 0,  // There is no overflow in the timeout setting
    CELLULAR_TIMEOUT_OVERFLOW,          // Overflow in timeout setting
} e_cellular_timeout_ovf_check_t;

typedef enum
{
    CELLULAR_ATC_RESPONSE_CONFIRMED = 0,    // AT command response confirmed
    CELLULAR_ATC_RESPONSE_UNCONFIRMED,      // AT command response Unconfirmed
} e_cellular_atc_res_check_t;

typedef enum
{
    CELLULAR_EDRX_MODE_INVALID        = 0,  // Disable the edrx function
    CELLULAR_EDRX_MODE_ACTIVE         = 1,  // Enable the edrx function
    CELLULAR_EDRX_MODE_ACTIVE_RESULT  = 2,  // Activate the edrx function and return the results
    CELLULAR_EDRX_MODE_INIT           = 3,  // Initialize and disable the edrx function
} e_cellular_edrx_mode_t;

typedef enum
{
    CELLULAR_EDRX_CYCLE_5_SEC = 0,  // edrx cycle(5.12sec)
    CELLULAR_EDRX_CYCLE_10_SEC,     // edrx cycle(10.24sec)
    CELLULAR_EDRX_CYCLE_20_SEC,     // edrx cycle(20.48sec)
    CELLULAR_EDRX_CYCLE_40_SEC,     // edrx cycle(40.96sec)
    CELLULAR_EDRX_CYCLE_81_SEC,     // edrx cycle(81.92sec)
    CELLULAR_EDRX_CYCLE_163_SEC,    // edrx cycle(163.84sec)
    CELLULAR_EDRX_CYCLE_327_SEC,    // edrx cycle(327.68sec)
    CELLULAR_EDRX_CYCLE_655_SEC,    // edrx cycle(655.36sec)
    CELLULAR_EDRX_CYCLE_1310_SEC,   // edrx cycle(1,310.72sec)
    CELLULAR_EDRX_CYCLE_2621_SEC,   // edrx cycle(2,621.44sec)
} e_cellular_edrx_cycle_t;

typedef enum
{
    CELLULAR_PTW_CYCLE_1_SEC = 0,   // PTW(1.28sec)
    CELLULAR_PTW_CYCLE_2_SEC,       // PTW(2.56sec)
    CELLULAR_PTW_CYCLE_4_SEC,       // PTW(3.84sec)
    CELLULAR_PTW_CYCLE_5_SEC,       // PTW(5.12sec)
    CELLULAR_PTW_CYCLE_6_SEC,       // PTW(6.40sec)
    CELLULAR_PTW_CYCLE_7_SEC,       // PTW(7.68sec)
    CELLULAR_PTW_CYCLE_9_SEC,       // PTW(8.96sec)
    CELLULAR_PTW_CYCLE_10_SEC,      // PTW(10.24sec)
    CELLULAR_PTW_CYCLE_11_SEC,      // PTW(11.52sec)
    CELLULAR_PTW_CYCLE_13_SEC,      // PTW(12.80sec)
    CELLULAR_PTW_CYCLE_14_SEC,      // PTW(14.08sec)
    CELLULAR_PTW_CYCLE_15_SEC,      // PTW(15.36sec)
    CELLULAR_PTW_CYCLE_16_SEC,      // PTW(16.64sec)
    CELLULAR_PTW_CYCLE_18_SEC,      // PTW(17.92sec)
    CELLULAR_PTW_CYCLE_19_SEC,      // PTW(19.20sec)
    CELLULAR_PTW_CYCLE_20_SEC,      // PTW(20.48sec)
} e_cellular_ptw_cycle_t;

typedef enum
{
    CELLULAR_PSM_MODE_INVALID   = 0,    // Disable the PSM function
    CELLULAR_PSM_MODE_ACTIVE    = 1,    // Enable the PSM function
    CELLULAR_PSM_MODE_INIT      = 2,    // Initialize and disable the PSM function
} e_cellular_psm_mode_t;

typedef enum
{
    CELLULAR_TAU_CYCLE_10_MIN = 0,  // TAU cycle(10min)
    CELLULAR_TAU_CYCLE_1_HOUR,      // TAU cycle(1hour)
    CELLULAR_TAU_CYCLE_10_HOUR,     // TAU cycle(10hour)
    CELLULAR_TAU_CYCLE_2_SEC,       // TAU cycle(2sec)
    CELLULAR_TAU_CYCLE_30_SEC,      // TAU cycle(30sec)
    CELLULAR_TAU_CYCLE_1_MIN,       // TAU cycle(1min)
    CELLULAR_TAU_CYCLE_320_HOUR,    // TAU cycle(320hour)
    CELLULAR_TAU_CYCLE_NONE,        // TAU cycle(Timer is deactivated)
} e_cellular_tau_cycle_t;

