renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/r_cellular_if.h
typedef enum
{
    CELLULAR_ACTIVE_CYCLE_2_SEC = 0,    // Active time(2sec)
    CELLULAR_ACTIVE_CYCLE_1_MIN,        // Active time(1min)
    CELLULAR_ACTIVE_CYCLE_6_MIN,        // Active time(6min)
    CELLULAR_ACTIVE_CYCLE_NONE,         // Active time(Timer is deactivated)
} e_cellular_active_cycle_t;

typedef enum
{
    CELLULAR_CYCLE_MULTIPLIER_0  = 0,   // Multiplier 0
    CELLULAR_CYCLE_MULTIPLIER_1  = 1,   // Multiplier 1
    CELLULAR_CYCLE_MULTIPLIER_2  = 2,   // Multiplier 2
    CELLULAR_CYCLE_MULTIPLIER_3  = 3,   // Multiplier 3
    CELLULAR_CYCLE_MULTIPLIER_4  = 4,   // Multiplier 4
    CELLULAR_CYCLE_MULTIPLIER_5  = 5,   // Multiplier 5
    CELLULAR_CYCLE_MULTIPLIER_6  = 6,   // Multiplier 6
    CELLULAR_CYCLE_MULTIPLIER_7  = 7,   // Multiplier 7
    CELLULAR_CYCLE_MULTIPLIER_8  = 8,   // Multiplier 8
    CELLULAR_CYCLE_MULTIPLIER_9  = 9,   // Multiplier 9
    CELLULAR_CYCLE_MULTIPLIER_10 = 10,  // Multiplier 10
    CELLULAR_CYCLE_MULTIPLIER_11 = 11,  // Multiplier 11
    CELLULAR_CYCLE_MULTIPLIER_12 = 12,  // Multiplier 12
    CELLULAR_CYCLE_MULTIPLIER_13 = 13,  // Multiplier 13
    CELLULAR_CYCLE_MULTIPLIER_14 = 14,  // Multiplier 14
    CELLULAR_CYCLE_MULTIPLIER_15 = 15,  // Multiplier 15
    CELLULAR_CYCLE_MULTIPLIER_16 = 16,  // Multiplier 16
    CELLULAR_CYCLE_MULTIPLIER_17 = 17,  // Multiplier 17
    CELLULAR_CYCLE_MULTIPLIER_18 = 18,  // Multiplier 18
    CELLULAR_CYCLE_MULTIPLIER_19 = 19,  // Multiplier 19
    CELLULAR_CYCLE_MULTIPLIER_20 = 20,  // Multiplier 20
    CELLULAR_CYCLE_MULTIPLIER_21 = 21,  // Multiplier 21
    CELLULAR_CYCLE_MULTIPLIER_22 = 22,  // Multiplier 22
    CELLULAR_CYCLE_MULTIPLIER_23 = 23,  // Multiplier 23
    CELLULAR_CYCLE_MULTIPLIER_24 = 24,  // Multiplier 24
    CELLULAR_CYCLE_MULTIPLIER_25 = 25,  // Multiplier 25
    CELLULAR_CYCLE_MULTIPLIER_26 = 26,  // Multiplier 26
    CELLULAR_CYCLE_MULTIPLIER_27 = 27,  // Multiplier 27
    CELLULAR_CYCLE_MULTIPLIER_28 = 28,  // Multiplier 28
    CELLULAR_CYCLE_MULTIPLIER_29 = 29,  // Multiplier 29
    CELLULAR_CYCLE_MULTIPLIER_30 = 30,  // Multiplier 30
    CELLULAR_CYCLE_MULTIPLIER_31 = 31,  // Multiplier 31
} e_cellular_cycle_multiplier_t;

typedef enum
{
    CELLULAR_AUTH_TYPE_NONE = 0,    // Authentication protocol not used
    CELLULAR_AUTH_TYPE_PAP,         // Authentication protocol uses PAP
    CELLULAR_AUTH_TYPE_CHAP,        // Authentication protocol uses CHAP
    CELLULAR_AUTH_TYPE_MAX,         // End of enumeration
} e_cellular_auth_type_t;

typedef enum
{
    CELLULAR_DISABLE_AUTO_CONNECT = 0,  // Disable automatic connection to AP
    CELLULAR_ENABLE_AUTO_CONNECT,       // Enable automatic connection to AP (next start-up or restart)
} e_cellular_auto_connect_t;

typedef enum
{
    CELLULAR_PSM_DEACTIVE = 0,  // Deactivate PSM
    CELLULAR_PSM_ACTIVE = 1,    // Activate PSM
} e_cellular_psm_active_t;

typedef enum
{
    CELLULAR_FIRM_UPGRADE_BLOCKING    = 0,  // Perform firmware upgrade in blocking mode
    CELLULAR_FIRM_UPGRADE_NONBLOCKING = 1,  // Perform firmware upgrade in non-blocking mode
    CELLULAR_FIRM_UPGRADE_CANCEL      = 2,  // Cancel firmware upgrade
} e_cellular_firmupgrade_t;

typedef enum
{
    CELLULAR_NVM_TYPE_CERTIFICATE = 0,  // Certificate
    CELLULAR_NVM_TYPE_PRIVATEKEY        // PrivateKey
} e_cellular_nvm_type_t;

typedef enum
{
    CELLULAR_NO_CERT_VALIDATE         = 0,  // Certificate not validated
    CELLULAR_VALIDATE_CERT_EXPDATE    = 1,  // Validate certificate chain, validity period
    CELLULAR_VALIDATE_CERT_EXPDATE_CN = 5,  // Validate certificate chain, validity period, common name
} e_cellular_cert_validate_level_t;

#if (CELLULAR_IMPLEMENT_TYPE == 'B')
typedef enum
{
    CELLULAR_SSL_DEACTIVE = 0,  // Deactivate secure socket
    CELLULAR_SSL_ACTIVE   = 1,  // Activate SSL/TLS on the socket
} e_cellular_ssl_active_t;
#endif

typedef struct cellular_time_ctrl
{
    e_cellular_timeout_ovf_check_t timeout_overflow_flag;
    uint32_t                       start_time;  // Start time
    uint32_t                       this_time;   // Now Time
    uint32_t                       end_time;    // End time
} st_cellular_time_ctrl_t;

typedef struct cellular_datetime
{
    uint8_t year;       // Year
    uint8_t month;      // Month
    uint8_t day;        // Day
    uint8_t hour;       // Hour
    uint8_t min;        // Minute
    uint8_t sec;        // Second
    int8_t  timezone;   // Time Zone
} st_cellular_datetime_t;

typedef struct cellular_edrx_config
{
    e_cellular_edrx_mode_t      edrx_mode;  // eDRX mode
    e_cellular_edrx_cycle_t     edrx_cycle; // eDRX cycle
    e_cellular_ptw_cycle_t      ptw_cycle;  // PTW cycle
} st_cellular_edrx_config_t;

typedef struct cellular_psm_config
{
    e_cellular_psm_mode_t           psm_mode;           // PSM mode
    e_cellular_tau_cycle_t          tau_cycle;          // TAU cycle
    e_cellular_cycle_multiplier_t   tau_multiplier;     // TAU cycle multiplier
    e_cellular_active_cycle_t       active_cycle;       // Active time
    e_cellular_cycle_multiplier_t   active_multiplier;  // Active time multiplier
} st_cellular_psm_config_t;

typedef struct cellular_iccid
{
    uint8_t iccid[CELLULAR_MAX_ICCID_LENGTH+1];   // Card identification number
} st_cellular_iccid_t;

typedef struct cellular_imei
{
    uint8_t imei[CELLULAR_MAX_IMEI_LENGTH+1]; // International Mobile station Equipment Identity number
} st_cellular_imei_t;

typedef struct cellular_imsi
{
    uint8_t imsi[CELLULAR_MAX_IMSI_LENGTH+1]; // International Mobile Subscriber Identity
} st_cellular_imsi_t;

typedef struct cellular_phonenum
{
    uint8_t phonenum[CELLULAR_MAX_PHONENUM_LENGTH+1]; // Phone Number
} st_cellular_phonenum_t;

typedef struct cellular_rssi
{
    uint8_t rssi[CELLULAR_MAX_RSSI_LENGTH+1]; // Received signal strength indication
    uint8_t ber[CELLULAR_MAX_BER_LENGTH+1];   // Channel bit error rate (in percent)
} st_cellular_rssi_t;

typedef struct cellular_svn
{
    uint8_t svn[CELLULAR_MAX_SVN_LENGTH+1];           // Software Version Number
    uint8_t revision[CELLULAR_MAX_REVISION_LENGTH+1]; // Software Revision Number
    uint8_t lr_svn[CELLULAR_MAX_LR_SVN_LENGTH+1];     // LR Software Version Number
} st_cellular_svn_t;

typedef struct cellular_notice
{
    e_cellular_network_result_t level;          // Network status notification level
    e_cellular_reg_stat_t       stat;           // EPS registration status
    uint8_t                     ta_code[5];     // Tracking area code
    uint8_t                     cell_id[9];     // Cell ID
    e_cellular_access_tec_t     access_tec;     // Access Technology
    uint8_t                     active_time[9]; // Active-Time
    uint8_t                     tau[9];         // Periodic-TAU
} st_cellular_notice_t;

