renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/r_cellular_if.h
typedef struct cellular_ipaddr
{
    uint8_t     ipv4[CELLULAR_IPV4_ADDR_LENGTH+1];    // IPv4 address
    uint8_t     ipv6[CELLULAR_IPV6_ADDR_LENGTH+1];    // IPv6 address
} st_cellular_ipaddr_t;

typedef struct cellular_updatestate
{
    uint8_t     state[CELLULAR_UPDATE_STATE_LENGTH+1];  // Firmware Upgrade Status
} st_cellular_updatestate_t;

typedef struct cellular_certificate
{
    uint8_t     certificate[CELLULAR_ATC_RESPONSE_BUFF_SIZE];   // Certificates or other data
} st_cellular_certificate_t;

typedef struct cellular_ping_cfg
{
    uint32_t    count;      // Number of Ping Echo Request to send (default: 4, 1-64)
    uint16_t    len;        // Length of Ping Echo Request message (default: 32, 32-1400).
    uint16_t    interval;   // Wait interval seconds between sending each Ping Echo Request (in seconds)(default: 1, 1-600)
    uint32_t    timeout;    // Time to wait for an Echo Reply (in seconds)(default: 10, 1-60).
} st_cellular_ping_cfg_t;

typedef struct cellular_sci_ctrl
{
    uint32_t                         baud_rate;                                     // Baudrate
    uint32_t                         tx_buff_size;                                  // Command send buffer size
    uint8_t                          atc_buff[CELLULAR_ATC_BUFF_SIZE];              // AT command buffer
    uint32_t                         rx_buff_size;                                  // Command receive buffer size
    uint8_t                          receive_buff[CELLULAR_ATC_RESPONSE_BUFF_SIZE]; // receive buffer
    uint16_t                         tx_process_size;                               // Size per send
    uint16_t                         rx_process_size;                               // Size per receive
    uint32_t                         atc_timeout;                                   // AT command response timeout
    volatile e_cellular_tx_end_flg_t tx_end_flg;                                    // Transmission completion flag
    sci_cb_evt_t                     sci_err_flg;                                   // sci error flg
    st_cellular_time_ctrl_t          timeout_ctrl;                                  // Timeout management structure
    e_atc_list_t                     at_command;                                    // Running AT command
    e_cellular_atc_return_t          atc_res;                                       // AT command response
    e_cellular_atc_res_check_t       atc_flg;                                       // Response status of AT command
    sci_hdl_t                        sci_hdl;                                       // SCI control block handle
} st_cellular_sci_ctrl_t;

typedef struct cellular_socket_ctrl
{
    uint32_t                          receive_num;              // Size received from the module
    int16_t                           receive_unprocessed_size; // Data size possessed by the module
    volatile e_cellular_receive_flg_t receive_flg;              // Receivable Flag
    uint8_t *                         p_recv;                   // Pointer to the receive buffer
    int32_t                           total_recv_count;         // Total received data size
    uint16_t                          packet_data_size;         // Data size per packet
    uint16_t                          exchange_timeout;         // Exchange timeout
    uint16_t                          connect_timeout;          // Socket connection timeout
    uint8_t                           send_timeout;             // Packet transmission timeout
    uint32_t                          receive_count;            // Receive byte count
    e_cellular_socket_status_t        socket_status;            // Socket Status
    uint8_t                           ipversion;                // IP Version
    uint8_t                           protocol;                 // Protocol Type
    st_cellular_ipaddr_t              ip_addr;                  // Destination address
    uint32_t                          port;                     // Destination port number
    void *                            rx_semaphore;             // Semaphore handle (for receiving)
    st_cellular_time_ctrl_t           cellular_tx_timeout_ctrl; // Transmission timeout management structure
    st_cellular_time_ctrl_t           cellular_rx_timeout_ctrl; // Receive timeout management structure
} st_cellular_socket_ctrl_t;

typedef struct cellular_ap_cfg
{
    uint8_t                ap_name[CELLULAR_MAX_AP_NAME_LENGTH+1];       // AP name
    uint8_t                ap_user_name[CELLULAR_MAX_AP_ID_LENGTH+1];    // AP user name
    uint8_t                ap_pass[CELLULAR_MAX_AP_PASS_LENGTH+1];       // AP Password
    e_cellular_auth_type_t auth_type;                                    // Authentication protocol type
} st_cellular_ap_cfg_t;

typedef struct cellular_ring_ctrl
{
    e_cellular_psm_active_t psm;                // PSM status
    void *                  rts_semaphore;      // Semaphore handle
    void *                  ring_event;         // Event Group Handles
    void *                  ring_taskhandle;    // Task handle
    irq_handle_t            ring_irqhandle;     // IRQ control block handle
    st_cellular_time_ctrl_t timeout;            // Timeout management structure
} st_cellular_ring_ctrl_t;

typedef struct cellular_ctrl
{
    uint8_t                     running_api_count;  // Number of running APIs
    uint16_t                    ap_connect_retry;   // AP connection retry limit
    e_cellular_system_status_t  system_state;       // AP connection status
    e_cellular_module_status_t  module_status;      // Module Status
    st_cellular_ipaddr_t        pdp_addr;           // PDP Address
    void *                      at_semaphore;       // Semaphore handle (for at command)
    void *                      recv_taskhandle;    // Task handle
    void *                      eventgroup;         // Event Group Handles
    void *                      recv_data;          // Pointer to the storage location of the retrieved information.
    st_cellular_sci_ctrl_t      sci_ctrl;           // Module communication management structure
    st_cellular_ring_ctrl_t     ring_ctrl;          // Ring line management structure
    st_cellular_socket_ctrl_t * p_socket_ctrl;      // Pointer to the socket management structure
    uint8_t                     creatable_socket;   // Number of sockets to create
} st_cellular_ctrl_t;

typedef struct cellular_cfg
{
    uint8_t     sim_pin_code[CELLULAR_MAX_SIM_PASS_LENGTH+1]; // SIM Pin Code
    uint32_t    baud_rate;              // Baudrate
    uint16_t    ap_cgatt_retry_count;   // AP connection retry limit
    uint32_t    sci_timeout;            // Communication timeout with module
    uint16_t    tx_process_size;        // Size per send(in bytes)(1~1500)
    uint16_t    rx_process_size;        // Size per receive(in bytes)(1~1500)
    uint16_t    packet_data_size;       // Data size per packet(in bytes)(0~1500)
    uint16_t    exchange_timeout;       // Exchange timeout(in seconds)(0~65535)
    uint16_t    connect_timeout;        // Socket connection timeout(in hundreds of milliseconds)(0,10~1200)
    uint8_t     send_timeout;           // Packet transmission timeout(in hundreds of milliseconds)(0~255). Set fixed value(10).
    uint8_t     creatable_socket;       // Number of sockets to create(1~6)
} st_cellular_cfg_t;

/*****************************************************************************
 * Public Functions
 *****************************************************************************/
/*************************************************************************************************
 * Function Name  @fn            R_CELLULAR_Open
 * Description    @details       Establish a communication state with the module.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     p_cfg -
 *                                  Pointer to the configuration structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully established a communication state with the module
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_ALREADY_OPEN -
 *                                  Already initialized.
 *                @retval        CELLULAR_ERR_SERIAL_OPEN -
 *                                  Serial initialization failed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_SEMAPHORE_INIT -
 *                                  Semaphore initialization failed.
 *                @retval        CELLULAR_ERR_EVENT_GROUP_INIT -
 *                                  Event group initialization failed.
 *                @retval        CELLULAR_ERR_CREATE_TASK -
 *                                  Task initialization failed.
 *                @retval        CELLULAR_ERR_MEMORY_ALLOCATION -
 *                                  Failed to allocate memory.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ************************************************************************************************/
e_cellular_err_t R_CELLULAR_Open (st_cellular_ctrl_t * const p_ctrl, const st_cellular_cfg_t * const p_cfg);

/***************************************************************************************
 * Function Name  @fn            R_CELLULAR_Close
 * Description    @details       Terminate communication with the module.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully disconnected communication with module.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 **************************************************************************************/
e_cellular_err_t R_CELLULAR_Close (st_cellular_ctrl_t * const p_ctrl);

/**************************************************************************
 * Function Name  @fn            R_CELLULAR_APConnect
 * Description    @details       Connect to an access point.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     p_ap_cfg -
 *                                  Pointer to AP information structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully connected to access point.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_ALREADY_CONNECT
 *                                  Already connected to AP.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 *************************************************************************/
e_cellular_err_t R_CELLULAR_APConnect (st_cellular_ctrl_t * const p_ctrl, const st_cellular_ap_cfg_t * const p_ap_cfg);

