renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/r_cellular_if.h
/******************************************************************************
 * Function Name  @fn            R_CELLULAR_IsConnected
 * Description    @details       Get the connection status to the access point.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained connection status.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_NOT_CONNECT -
 *                                  Not connected to access point.
 *****************************************************************************/
e_cellular_err_t R_CELLULAR_IsConnected (st_cellular_ctrl_t * const p_ctrl);

/*******************************************************************************
 * Function Name  @fn            R_CELLULAR_Disconnect
 * Description    @details       Disconnect from the access point.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully disconnected from access point.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_NOT_CONNECT -
 *                                  Not connected to access point.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ******************************************************************************/
e_cellular_err_t R_CELLULAR_Disconnect (st_cellular_ctrl_t * const p_ctrl);

/************************************************************************
 * Function Name  @fn            R_CELLULAR_CreateSocket
 * Description    @details       Perform socket connection.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     protocol_type -
 *                                  Protocol Type.
 *                @param[in]     ip_version -
 *                                  IP Version.
 * Return Value   @retval        1 to 6
 *                                  Successfully created a socket.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_NOT_CONNECT -
 *                                  Not connected to access point.
 *                @retval        CELLULAR_ERR_SOCKET_CREATE_LIMIT
 *                                  Socket creation limit exceeded.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ***********************************************************************/
int32_t R_CELLULAR_CreateSocket (st_cellular_ctrl_t * const p_ctrl,
                                    const uint8_t protocol_type,
                                    const uint8_t ip_version);

/************************************************************************
 * Function Name  @fn            R_CELLULAR_CloseSocket
 * Description    @details       Close the socket.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     socket_no -
 *                                  Number to close socket.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully closed the socket.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_NOT_CONNECT -
 *                                  Not connected to access point.
 *                @retval        CELLULAR_ERR_SOCKET_NOT_READY
 *                                  Socket is not ready for use.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ***********************************************************************/
e_cellular_err_t R_CELLULAR_CloseSocket (st_cellular_ctrl_t * const p_ctrl, const uint8_t socket_no);

/************************************************************************
 * Function Name  @fn            R_CELLULAR_ConnectSocket
 * Description    @details       Perform socket connection.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     socket_no -
 *                                  Number to close socket.
 *                @param[in]     p_ip_addr -
 *                                  Pointer to destination address.
 *                @param[in]     port -
 *                                  Destination port number.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully socket connection.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                  Communication with module timed out.
 *                @retval        CELLULAR_ERR_NOT_CONNECT -
 *                                  Not connected to access point.
 *                @retval        CELLULAR_ERR_ALREADY_SOCKET_CONNECT
 *                                  Already socket connect.
 *                @retval        CELLULAR_ERR_SOCKET_NOT_READY
 *                                  Socket is not ready for use.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ***********************************************************************/
e_cellular_err_t R_CELLULAR_ConnectSocket (st_cellular_ctrl_t * const p_ctrl, const uint8_t socket_no,
                                                const uint8_t * const p_ip_addr, const uint16_t port);

/************************************************************************
 * Function Name  @fn            R_CELLULAR_ConnectSocketToHost
 * Description    @details       Perform socket connection.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     socket_no -
 *                                  Number to connect socket.
 *                @param[in]     p_hostname -
 *                                  Pointer to destination host name.
 *                @param[in]     port -
 *                                  Destination port number.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully socket connection.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_NOT_CONNECT -
 *                                  Not connected to access point.
 *                @retval        CELLULAR_ERR_ALREADY_SOCKET_CONNECT -
 *                                  Already socket connect.
 *                @retval        CELLULAR_ERR_SOCKET_NOT_READY
 *                                  Socket not created.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ***********************************************************************/
e_cellular_err_t R_CELLULAR_ConnectSocketToHost (st_cellular_ctrl_t * const p_ctrl, const uint8_t socket_no,
                                                const uint8_t * p_hostname, const uint16_t port);

/************************************************************************
 * Function Name  @fn            R_CELLULAR_ShutdownSocket
 * Description    @details       Disconnect the socket connection.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     socket_no -
 *                                  Number to close socket.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully disconnected the socket connection.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_NOT_CONNECT -
 *                                  Not connected to access point.
 *                @retval        CELLULAR_ERR_SOCKET_NOT_READY
 *                                  Socket not created.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ***********************************************************************/
e_cellular_err_t R_CELLULAR_ShutdownSocket (st_cellular_ctrl_t * const p_ctrl, const uint8_t socket_no);

/*************************************************************************************************
 * Function Name  @fn            R_CELLULAR_SendSocket
 * Description    @details       Sending data to a socket.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     socket_no -
 *                                  Socket number for sending data.
 *                @param[in]     p_data -
 *                                  Pointer to send data.
 *                @param[in]     length -
 *                                  Send data size.
 *                @param[in]     timeout_ms -
 *                                  timeout millisecond.
 * Return Value   @retval        More than 1 -
 *                                  Successfully sent data.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_NOT_CONNECT -
 *                                  Not connected to access point.
 *                @retval        CELLULAR_ERR_SOCKET_NOT_READY
 *                                  Socket not created.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ************************************************************************************************/
int32_t R_CELLULAR_SendSocket (st_cellular_ctrl_t * const p_ctrl, const uint8_t socket_no,
                                    const uint8_t * const p_data, const int32_t length,
                                    const uint32_t timeout_ms);

/*************************************************************************************************
 * Function Name  @fn            R_CELLULAR_ReceiveSocket
 * Description    @details       Reading data from a socket.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     socket_no -
 *                                  Socket number for reading data.
 *                @param[in]     p_data -
 *                                  Pointer to store the read data.
 *                @param[in]     length -
 *                                  Read data size.
 *                @param[in]     timeout_ms -
 *                                  timeout millisecond.
 * Return Value   @retval        More than 1 -
 *                                  Successfully loaded data.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_NOT_CONNECT -
 *                                  Not connected to access point.
 *                @retval        CELLULAR_ERR_SOCKET_NOT_READY
 *                                  Socket not created.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ************************************************************************************************/
int32_t R_CELLULAR_ReceiveSocket (st_cellular_ctrl_t * const p_ctrl, const uint8_t socket_no,
                                        uint8_t * const p_data, const int32_t length,
                                        const uint32_t timeout_ms);

