renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/r_cellular_if.h
/*********************************************************************************************************
 * Function Name  @fn            R_CELLULAR_ListeningSocket
 * Description    @details       Specifies the socket listening for TCP connections on the specified port.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     socket_no -
 *                                  Socket number to listen for TCP connections.
 *                @param[in]     ip_version -
 *                                  IP Version.
 *                @param[in]     port -
 *                                  Port number to listen for TCP connections.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully set the time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_NOT_CONNECT -
 *                                  Not connected to access point.
 *                @retval        CELLULAR_ERR_SOCKET_NOT_READY
 *                                  Socket not created.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ********************************************************************************************************/
e_cellular_err_t R_CELLULAR_ListeningSocket (st_cellular_ctrl_t * const p_ctrl, const uint8_t socket_no,
                                                const uint8_t ip_version, const uint16_t port);

/*************************************************************************************************
 * Function Name  @fn            R_CELLULAR_SetTime
 * Description    @details       Set time to module.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     p_time -
 *                                  Pointer to set time.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully set the time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ************************************************************************************************/
e_cellular_err_t R_CELLULAR_SetTime (st_cellular_ctrl_t * const p_ctrl, const st_cellular_datetime_t * const p_time);

/************************************************************************
 * Function Name  @fn            R_CELLULAR_GetTime
 * Description    @details       Get the time in the module.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[out]    p_time -
 *                                  Pointer to store the retrieved time.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ***********************************************************************/
e_cellular_err_t R_CELLULAR_GetTime (st_cellular_ctrl_t * const p_ctrl, st_cellular_datetime_t * const p_time);

/************************************************************************
 * Function Name  @fn            R_CELLULAR_GetIMEI
 * Description    @details       Get IMEI.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[out]    p_imei -
 *                                  Pointer to store the retrieved IMEI.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ***********************************************************************/
e_cellular_err_t R_CELLULAR_GetIMEI (st_cellular_ctrl_t * const p_ctrl, st_cellular_imei_t * const p_imei);

/************************************************************************
 * Function Name  @fn            R_CELLULAR_GetIMSI
 * Description    @details       Get IMSI.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] p_imsi -
 *                                  Pointer to store the retrieved IMSI.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ***********************************************************************/
e_cellular_err_t R_CELLULAR_GetIMSI (st_cellular_ctrl_t * const p_ctrl, st_cellular_imsi_t * const p_imsi);

/************************************************************************
 * Function Name  @fn            R_CELLULAR_GetSVN
 * Description    @details       Get SVN.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] p_svn -
 *                                  Pointer to store the retrieved SVN.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ***********************************************************************/
e_cellular_err_t R_CELLULAR_GetSVN (st_cellular_ctrl_t * const p_ctrl, st_cellular_svn_t * const p_svn);

