renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/r_cellular_if.h
/*******************************************************************************
 * Function Name  @fn            R_CELLULAR_GetPhonenum
 * Description    @details       Get Phone Number.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] p_phonenum -
 *                                  Pointer to store the retrieved Phone number.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ******************************************************************************/
e_cellular_err_t R_CELLULAR_GetPhonenum (st_cellular_ctrl_t * const p_ctrl, st_cellular_phonenum_t * const p_phonenum);

/*******************************************************************************
 * Function Name  @fn            R_CELLULAR_GetICCID
 * Description    @details       Get ICCID.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] p_iccid -
 *                                  Pointer to store the retrieved ICCID.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ******************************************************************************/
e_cellular_err_t R_CELLULAR_GetICCID (st_cellular_ctrl_t * const p_ctrl, st_cellular_iccid_t * const p_iccid);

/*******************************************************************************
 * Function Name  @fn            R_CELLULAR_GetRSSI
 * Description    @details       Get RSSI.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] p_rssi -
 *                                  Pointer to store the retrieved RSSI.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ******************************************************************************/
e_cellular_err_t R_CELLULAR_GetRSSI (st_cellular_ctrl_t * const p_ctrl, st_cellular_rssi_t * const p_rssi);

/************************************************************************
 * Function Name  @fn            R_CELLULAR_DnsQuery
 * Description    @details       Execute DNS query.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     p_domain_name -
 *                                  Pointer to domain name.
 *                @param[in]     ip_version -
 *                                  Protocol Type.
 *                @param[in/out] p_addr -
 *                                  Pointer to store IP address.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully DNS query.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_NOT_CONNECT -
 *                                  Not connected to access point.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ***********************************************************************/
e_cellular_err_t R_CELLULAR_DnsQuery (st_cellular_ctrl_t * const p_ctrl, const uint8_t * const p_domain_name,
                                        const uint8_t ip_version, st_cellular_ipaddr_t * const p_addr);

/************************************************************************
 * Function Name  @fn            R_CELLULAR_SetEDRX
 * Description    @details       Set eDRX.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     p_config -
 *                                  Pointer to the configuration structure.
 *                @param[in/out] p_result -
 *                                  Pointer to the result structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully set up eDRX.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ***********************************************************************/
e_cellular_err_t R_CELLULAR_SetEDRX (st_cellular_ctrl_t * const p_ctrl,
                                        const st_cellular_edrx_config_t * const p_config,
                                        st_cellular_edrx_config_t * const p_result);

/************************************************************************
 * Function Name  @fn            R_CELLULAR_SetPSM
 * Description    @details       Execute DNS query.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     p_config -
 *                                  Pointer to the configuration structure.
 *                @param[in/out] p_result -
 *                                  Pointer to the result structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully set up PSM.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ***********************************************************************/
e_cellular_err_t R_CELLULAR_SetPSM (st_cellular_ctrl_t * const p_ctrl,
                                        const st_cellular_psm_config_t * const p_config,
                                        st_cellular_psm_config_t * const p_result);

/*************************************************************************************************
 * Function Name  @fn            R_CELLULAR_Ping
 * Description    @details       Perform Ping.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     p_hostname -
 *                                  Pointer to destination host name.
 *                @param[in]     p_cfg -
 *                                  Pointer to the configuration structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_NOT_CONNECT -
 *                                  Not connected to access point.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 *                @retval        CELLULAR_ERR_MEMORY_ALLOCATION -
 *                                  Failed to create the memory pool.
 ************************************************************************************************/
e_cellular_err_t R_CELLULAR_Ping (st_cellular_ctrl_t * const p_ctrl, const uint8_t * const p_hostname,
                                    const st_cellular_ping_cfg_t * const p_cfg);

/*************************************************************************************************
 * Function Name  @fn            R_CELLULAR_GetAPConnectState
 * Description    @details       Get AP connection status.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     level -
 *                                  Result notification level.
 *                @param[in/out] p_result -
 *                                  Pointer to structure for storing results.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ************************************************************************************************/
e_cellular_err_t R_CELLULAR_GetAPConnectState (st_cellular_ctrl_t * const p_ctrl,
                                                const e_cellular_network_result_t level,
                                                st_cellular_notice_t * const p_result);

/*************************************************************************************************
 * Function Name  @fn            R_CELLULAR_GetCellInfo
 * Description    @details       Get cell information.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     type -
 *                                  Notification information type.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ************************************************************************************************/
e_cellular_err_t R_CELLULAR_GetCellInfo (st_cellular_ctrl_t * const p_ctrl, const e_cellular_info_type_t type);

/*************************************************************************************************
 * Function Name  @fn            R_CELLULAR_AutoConnectConfig
 * Description    @details       Enable/disable automatic connection to APs.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     type -
 *                                  Enable/disable.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ************************************************************************************************/
e_cellular_err_t R_CELLULAR_AutoConnectConfig (st_cellular_ctrl_t * const p_ctrl, const e_cellular_auto_connect_t type);

/*************************************************************************************************
 * Function Name  @fn            R_CELLULAR_SetBand
 * Description    @details       Set the band settings.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     p_band -
 *                                  Band to be set.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ************************************************************************************************/
e_cellular_err_t R_CELLULAR_SetBand (st_cellular_ctrl_t * const p_ctrl, const uint8_t * const p_band);

/*************************************************************************************************
 * Function Name  @fn            R_CELLULAR_GetPDPAddress
 * Description    @details       Get PDP address.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] p_addr -
 *                                  Pointer to array storing PDP addresses.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_NOT_CONNECT -
 *                                  Not connected to access point.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ************************************************************************************************/
e_cellular_err_t R_CELLULAR_GetPDPAddress (st_cellular_ctrl_t * const p_ctrl, st_cellular_ipaddr_t * const p_addr);

/*************************************************************************************************
 * Function Name  @fn            R_CELLULAR_SoftwareReset
 * Description    @details       Reset module by AT command.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ************************************************************************************************/
e_cellular_err_t R_CELLULAR_SoftwareReset (st_cellular_ctrl_t * const p_ctrl);

/*************************************************************************************************
 * Function Name  @fn            R_CELLULAR_HardwareReset
 * Description    @details       Reset the module.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ************************************************************************************************/
e_cellular_err_t R_CELLULAR_HardwareReset (st_cellular_ctrl_t * const p_ctrl);

/*************************************************************************************************
 * Function Name  @fn            R_CELLULAR_FactoryReset
 * Description    @details       Restore factory conditions.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ************************************************************************************************/
e_cellular_err_t R_CELLULAR_FactoryReset (st_cellular_ctrl_t * const p_ctrl);

/*************************************************************************************************
 * Function Name  @fn            R_CELLULAR_RTS_Ctrl
 * Description    @details       Restore factory conditions.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     lowhigh -
 *                                  Port output state.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 ************************************************************************************************/
e_cellular_err_t R_CELLULAR_RTS_Ctrl (st_cellular_ctrl_t * const p_ctrl, const uint8_t lowhigh);

