renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/r_cellular_if.h
/***************************************************************************************
 * Function Name  @fn            R_CELLULAR_GetEDRX
 * Description    @details       Get edrx setting value
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] p_result -
 *                                  Pointer to the result structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successful acquisition of edrx configuration values.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 **************************************************************************************/
e_cellular_err_t R_CELLULAR_GetEDRX (st_cellular_ctrl_t * const p_ctrl, st_cellular_edrx_config_t * const p_result);

/***************************************************************************************
 * Function Name  @fn            R_CELLULAR_GetPSM
 * Description    @details       Get PSM setting value
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] p_result -
 *                                  Pointer to the result structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successful acquisition of PSM configuration values.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 **************************************************************************************/
e_cellular_err_t R_CELLULAR_GetPSM (st_cellular_ctrl_t * const p_ctrl, st_cellular_psm_config_t * const p_result);

/*************************************************************************************************
 * Function Name  @fn            R_CELLULAR_SetOperator
 * Description    @details       Set the band settings.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     p_operator -
 *                                  Operator to be set.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ************************************************************************************************/
e_cellular_err_t R_CELLULAR_SetOperator (st_cellular_ctrl_t * const p_ctrl, const uint8_t * const p_operator);

/*************************************************************************************************
 * Function Name  @fn            R_CELLULAR_FirmUpgrade
 * Description    @details       Perform firmware upgrade.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     p_url -
 *                                  URL of the firmware.
 *                @param[in]     command -
 *                                  Firmware upgrade command.
 *                @param[in]     spid -
 *                                  Security Profile ID.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_NOT_CONNECT -
 *                                  Not connected to access point.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ************************************************************************************************/
e_cellular_err_t R_CELLULAR_FirmUpgrade (st_cellular_ctrl_t * const p_ctrl, const uint8_t * const p_url,
                                            const e_cellular_firmupgrade_t command, const uint8_t spid);

/*************************************************************************************************
 * Function Name  @fn            R_CELLULAR_FirmUpgradeBlocking
 * Description    @details       Perform firmware upgrade.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     p_url -
 *                                  URL of the firmware.
 *                @param[in]     spid -
 *                                  Security Profile ID.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_NOT_CONNECT -
 *                                  Not connected to access point.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ************************************************************************************************/
e_cellular_err_t R_CELLULAR_FirmUpgradeBlocking (st_cellular_ctrl_t * const p_ctrl, const uint8_t * const p_url,
                                                    const uint8_t spid);

/*************************************************************************************************
 * Function Name  @fn            R_CELLULAR_GetUpgradeState
 * Description    @details       Get firm upgrade status.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     p_state -
 *                                  Pointer to structure to store state.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ************************************************************************************************/
e_cellular_err_t R_CELLULAR_GetUpgradeState (st_cellular_ctrl_t * const p_ctrl,
                                                st_cellular_updatestate_t * const p_state);

/****************************************************************************
 * Function Name  @fn            R_CELLULAR_UnlockSIM
 * Description    @details       Unlock the SIM.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     p_pass -
 *                                  Pointer to password.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ***************************************************************************/
e_cellular_err_t R_CELLULAR_UnlockSIM (st_cellular_ctrl_t * const p_ctrl, const uint8_t * const p_pass);

/******************************************************************************************************
 * Function Name  @fn            R_CELLULAR_WriteCertificate
 * Description    @details       Write certificate or private key to non-volatile memory of the module.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     data_type -
 *                                  Information to write.
 *                @param[in]     index -
 *                                  Destination index.
 *                @param[in]     p_data -
 *                                  Pointer to the data to write.
 *                @param[in]     size -
 *                                  Size of the data to be written.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully write certificate.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 *****************************************************************************************************/
e_cellular_err_t R_CELLULAR_WriteCertificate (st_cellular_ctrl_t * const p_ctrl,
                                                    const e_cellular_nvm_type_t data_type,
                                                    const uint8_t index,
                                                    const uint8_t * p_data,
                                                    const uint32_t size);

/******************************************************************************************************
 * Function Name  @fn            R_CELLULAR_EraseCertificate
 * Description    @details       Erase certificate or private key to non-volatile memory of the module.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     data_type -
 *                                  Information to write.
 *                @param[in]     index -
 *                                  Destination index.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully erase certificate.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 *****************************************************************************************************/
e_cellular_err_t R_CELLULAR_EraseCertificate (st_cellular_ctrl_t * const p_ctrl,
                                                    const e_cellular_nvm_type_t data_type,
                                                    const uint8_t index);

/***************************************************************************************************************
 * Function Name  @fn            R_CELLULAR_GetCertificate
 * Description    @details       Obtain a certificate or private key stored in the module's non-volatile memory.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     data_type -
 *                                  Information to write.
 *                @param[in]     index -
 *                                  Destination index.
 *                @param[in/out] p_cert -
 *                                  Pointer to data writing destination.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained time.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 **************************************************************************************************************/
e_cellular_err_t R_CELLULAR_GetCertificate (st_cellular_ctrl_t * const p_ctrl,
                                                const e_cellular_nvm_type_t data_type,
                                                const uint8_t index,
                                                st_cellular_certificate_t * const p_cert);

