renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/r_cellular_if.h
/*******************************************************************************************
 * Function Name  @fn            R_CELLULAR_ConfigSSLProfile
 * Description    @details       Configurate security profile.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     security_profile_id -
 *                                  Security Profile identifier
 *                @param[in]     cert_valid_level -
 *                                  Server certificate validation
 *                @param[in]     ca_certificate_id -
 *                                  Certificate ID of a trusted certification authority
 *                                    by written to non-volatile memory.
 *                @param[in]     client_certificate_id -
 *                                  Client certificate ID by written to non-volatile memory.
 *                @param[in]     client_privatekey_id -
 *                                  Privatekey ID by written to non-volatile memory.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully configurate.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ******************************************************************************************/
e_cellular_err_t R_CELLULAR_ConfigSSLProfile (st_cellular_ctrl_t * const p_ctrl,
                                                const uint8_t security_profile_id,
                                                const e_cellular_cert_validate_level_t cert_valid_level,
                                                const uint8_t ca_certificate_id,
                                                const uint8_t client_certificate_id,
                                                const uint8_t client_privatekey_id);
#if (CELLULAR_IMPLEMENT_TYPE == 'B')
/************************************************************************
 * Function Name  @fn            R_CELLULAR_ConfigSSLSocket
 * Description    @details       Execute DNS query.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     socket_no -
 *                                  Socket number to configurate.
 *                @param[in]     active -
 *                                  Pointer to store IP address.
 *                @param[in]     security_profile_id -
 *                                  Link to Security Profile identifier.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully configurate.
 *                @retval        CELLULAR_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ERR_NOT_OPEN -
 *                                  R_CELLULAR_Open function is not executed.
 *                @retval        CELLULAR_ERR_SOCKET_NOT_READY -
 *                                  Socket is not ready for use.
 *                @retval        CELLULAR_ERR_ALREADY_SOCKET_CONNECT -
 *                                  Already socket connect.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_MODULE_TIMEOUT
 *                                      Communication with module timed out.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ***********************************************************************/
e_cellular_err_t R_CELLULAR_ConfigSSLSocket (st_cellular_ctrl_t * const p_ctrl,
                                                const uint8_t socket_no,
                                                const e_cellular_ssl_active_t active,
                                                const uint8_t security_profile_id);
#endif /* CELLULAR_IMPLEMENT_TYPE == 'B' */
#endif /* CELLULAR_IF_H */
